import { defineStore } from 'pinia'

export const useLayoutStorage = defineStore('layout', {
    state: () => ({
        currentCity: 'Москва',
        currentPhone: citiesPhones['Москва'],
        citiesBlocks: [
            ["Астрахань", "Барнаул", "Вологда", "Воронеж", "Екатеринбург", "Иваново", "Ижевск", "Казань", "Калининград", "Кемерово", "Киров", "Краснодар", "Красноярск", "Курск", "Липецк", "Тула",],
            ["Омск", "Орел", "Оренбург", "Пенза", "Пермь", "Ростов-на-Дону", "Рязань", "Самара", "Санкт-Петербург", "Саратов", "Ставрополь", "Сургут", "Тверь", "Томск", "Тюмень"],
            ["Алматы", "Нур-Султан", "Караганда", "Ульяновск", "Уфа", "Хабаровск", "Челябинск", "Череповец", "Ярославль", "Мурманск", "Набережные челны", "Нижний Новгород", "Новокузнецк", "Новосибирск", "Магнитогорск", "Москва"]
        ],
        
    }),
    actions: {
        pickCity(city) {
            if (citiesPhones[city] === undefined) {
                throw new Exception('Номер телефона не найден')
            }

            this.currentCity = city
            this.currentPhone = citiesPhones[city]
        }
    }
})

const citiesPhones = {
    'Москва': '+7 495 984 41 00',
    'Санкт-Петербург': '+7 495 984 41 00',
    'Астрахань': '+7 8512 201 044',
    'Барнаул': '+7 3852 720 358',
    'Вологда': '+7 8172 578 495',
    'Воронеж': '+7 473 202 91 54',
    'Екатеринбург': '+7 343 317 10 63',
    'Иваново': '+7 4932 999 112',
    'Ижевск': '+7 3412 331 149',
    'Казань': '+7 843 205 06 70',
    'Калининград': '+7 4012 615 490',
    'Кемерово': '+7 3842 457 088',
    'Киров': '+7 8332 213 024',
    'Краснодар': '+7 861 200 26 23',
    'Красноярск': '+7 391 216 75 02',
    'Курск': '+7 4712 251 318',
    'Липецк': '+7 4742 565 072',
    'Магнитогорск': '+7 3519 510 034',
    'Мурманск': '+7 8152 215 013',
    'Набережные челны': '+7 8552 917 754',
    'Нижний Новгород': '+7 831 281 84 52',
    "Новокузнецк": '+7 3843 560 221',
    'Новосибирск': '+7 383 285 53 46',
    'Омск': '+7 3812 905 921',
    'Оренбург': '+7 3532 480 436',
    'Пенза': '+7 8412 234 678',
    'Пермь': '+7 342 207 98 39',
    'Ростов-на-Дону': '+7 863 310 95 42',
    'Рязань': '+7 4912 772 830',
    'Самара': '+7 846 375 93 41',
    'Саратов': '+7 8452 338 226',
    'Ставрополь': '+7 8652 568 649',
    'Сургут': '+7 3462 779 214',
    'Тверь': '+7 4822 781 825',
    'Томск': '+7 3822 994 811',
    'Тула': '+7 4872 526 372',
    'Тюмень': '+7 3452 667 241',
    'Ульяновск': '+7 8422 312 036',
    'Уфа': '+7 347 225 05 96',
    'Хабаровск': '+7 4212 260 449',
    'Челябинск': '+7 351 220 10 76',
    'Череповец': '+7 8202 253 066',
    'Ярославль': '+7 4852 281 230',
    'Алматы': '+7 (7) 78017-3916',
    'Нур-Султан': '+7 (7) 78017-3917',
    'Караганда': '+7 (7) 78017-3918',
}
